#include"KEY4X4.h"
/********************************************************************
* 名称 : Delay_1ms()
* 功能 : 延时子程序，延时时间为 1ms * x
* 输入 : x (延时一毫秒的个数)
* 输出 : 无
***********************************************************************/
void KEY4X4_Delay_1ms(unsigned int i)//1ms延时
{
	unsigned char x,j;
	for(j=0;j<i;j++)
		for(x=0;x<=148;x++);	
}

/********************************************************************
* 名称 : delay()
* 功能 : 延时,延时时间大概为140US。
* 输入 : 无
* 输出 : 无
***********************************************************************/

void KEY4X4_delay()
{
	int i,j;
	for(i=0; i<=10; i++)
		for(j=0; j<=2; j++);
}
/********************************************************************
* 名称 : Keyscan()
* 功能 : 实现按键的读取。下面这个子程序是按处理 矩阵键盘 的基本方法处理的。
* 输入 : 无
* 输出 : 按键值
***********************************************************************/
unsigned char KEY4X4_Keyscan(void)
{
	unsigned char i,j, temp, Buffer[4] = {0xef, 0xdf, 0xbf, 0x7f};
	
	for(j=0; j<4; j++)
	{
		P2 = Buffer[j];
		/*以下三个_nop_();作用为让 P1 口的状态稳定*/
		KEY4X4_delay();
		temp = 0x01;                                                                                                                                                                    
		for(i=0; i<4; i++)
		{
			if(!(P2 & temp)) 
			{
				return (i+j*4);
			}
			temp <<= 1;
		}
	}	
}